Here's another example, where the value on the left side of the condition is a string, but `terraform test` doesn't tell you the value of the failed comparison

Here's the plan:
```
  # google_secret_manager_secret_iam_member.accessor_membership["serviceAccount:bar@foo-testproject.iam.gserviceaccount.com"] will be created
  + resource "google_secret_manager_secret_iam_member" "accessor_membership" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:bar@foo-testproject.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # google_secret_manager_secret_iam_member.accessor_membership["serviceAccount:foo@foo-testproject.iam.gserviceaccount.com"] will be created
  + resource "google_secret_manager_secret_iam_member" "accessor_membership" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:foo@foo-testproject.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # google_secret_manager_secret_iam_member.accessor_membership["user:chloe.george@example.com"] will be created
  + resource "google_secret_manager_secret_iam_member" "accessor_membership" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "user:chloe.george@example.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }
```

Here's the test assertion
```hcl
  assert {
    condition     = tolist(values(google_secret_manager_secret_iam_member.accessor_membership))[0].role == "roles/secretmanager.secretAccessor"
    error_message = "Incorrect role found."
  }
```

This passes, but if the right hand side of the condition is changed to a different string, you just see:
```
│ Error: Test assertion failed
│ 
│   on tests/main.tftest.hcl line 49, in run "basic":
│   49:     condition     = tolist(values(google_secret_manager_secret_iam_member.accessor_membership))[0].role == "roles/secretmanager.secretAccessr"
│     ├────────────────
│     │ google_secret_manager_secret_iam_member.accessor_membership is object with 4 attributes
│ 
│ Incorrect role found.
```

`google_secret_manager_secret_iam_member.accessor_membership` may be a member with 4 attributes, but the important point that we can't see (even in verbose or debug mode, I think) is that `roles/secretmanager.secretAccessr` does not equal `roles/secretmanager.secretAccessor`